Repository: DeepeshKalura/learnza
Catalog: lib/l10n/app_*.arb
Languages: ne

# appName
source: e-Shadananda
ne: षडान्द

# appNameDescription
source: The name of the application.
ne: अनुप्रयोगको नाम।

# madeBy
source: Made with ❤️ Miss Mongol scholarship fund- 2018 ❤️
ne: ❤️ सँग बनाइएको मिस मंगोल छात्रवृत्ति कोष - २०१८ ❤️

# madeByDescription
source: Credits for the app creator.
ne: अनुप्रयोग निर्माताको श्रेय।

# greeting
source: Welcome To Shadananda
ne: षडान्द स्वागत छ!

# loginMessage
source: Enter your credentials you get from Shadananda mail and enjoy countless books
ne: तपाईंले टुलिब इमेलबाट प्राप्त गरेको प्रमाणहरू प्रविष्ट गर्नुहोस् र अनगिन्ती पुस्तकहरूमा रमाउनुहोस्।

# loginMessageDescription
source: Message displayed on the login screen prompting the user to enter their credentials.
ne: लगइन स्क्रीनमा प्रयोगकर्तालाई आफ्नो प्रमाणहरू प्रविष्ट गर्न प्रेरित गर्ने सन्देश।

# emailLabel
source: Email
ne: इमेल

# emailLabelDescription
source: Label for the email input field.
ne: इमेल इनपुट क्षेत्रको लेबल।

# emailPlaceholder
source: Enter your email
ne: आफ्नो इमेल प्रविष्ट गर्नुहोस्

# emailPlaceholderDescription
source: Placeholder text for the email input field.
ne: इमेल इनपुट क्षेत्रको प्लेसहोल्डर पाठ।

# passwordLabel
source: Password
ne: पासवर्ड

# passwordLabelDescription
source: Label for the password input field.
ne: पासवर्ड इनपुट क्षेत्रको लेबल।

# passwordPlaceholder
source: Enter your password
ne: आफ्नो पासवर्ड प्रविष्ट गर्नुहोस्

# passwordPlaceholderDescription
source: Placeholder text for the password input field.
ne: पासवर्ड इनपुट क्षेत्रको प्लेसहोल्डर पाठ।

source: Forgot Password?
ne: पासवर्ड बिर्सनुभयो?

# forgotPasswordDescription
source: Label for the forgot password button.
ne: पासवर्ड बिर्सेको बटनको लेबल।

# loginButton
source: Login
ne: लगइन

# loginButtonDescription
source: Label for the login button.
ne: लगइन बटनको लेबल।

# errorTitle
source: Uh oh! Something went wrong
ne: ओह! केही गलत भयो

# errorTitleDescription
source: Title of the error message shown on login failure.
ne: लगइन असफल भएको बेलामा त्रुटि सन्देशको शीर्षक।

source: Try again
ne: फेरि प्रयास गर्नुहोस्

# tryAgainDescription
source: Label for the retry button in error messages.
ne: त्रुटि सन्देशमा पुन: प्रयास बटनको लेबल।

# emailRequired
source: Valid Email is required
ne: मान्य इमेल आवश्यक छ

# emailRequiredDescription
source: Message displayed when email is missing or invalid.
ne: इमेल गुम वा अमान्य भएको बेलामा देखाइने सन्देश।

# emailRequiredDescriptionLong
source: Please enter your email
ne: कृपया आफ्नो इमेल प्रविष्ट गर्नुहोस्

# emailRequiredDescriptionLongDescription
source: Detailed explanation for the email required error.
ne: इमेल आवश्यक त्रुटिको विस्तृत विवरण।

# passwordEmptyError
source: Please enter your password
ne: कृपया आफ्नो पासवर्ड प्रविष्ट गर्नुहोस्

# passwordEmptyErrorDescription
source: Error message shown when password field is empty.
ne: पासवर्ड इनपुट क्षेत्र खाली भएको बेलामा देखाइने सन्देश।

# passwordLengthError
source: Password must be at least 6 characters
ne: पासवर्ड कम्तीमा ६ अक्षरको हुनुपर्छ

# passwordLengthErrorDescription
source: Error message shown when the password is too short.
ne: पासवर्ड छोटो भएको बेलामा देखाइने त्रुटि सन्देश।

# passwordResetTitle
source: Password Reset Email Sent
ne: पासवर्ड रिसेट इमेल पठाइयो

# passwordResetTitleDescription
source: Message shown when a password reset email is successfully sent.
ne: पासवर्ड रिसेट इमेल सफलतापूर्वक पठाइएको सन्देश।

# passwordResetDescription
source: Please check your email for further instructions
ne: थप निर्देशनका लागि कृपया आफ्नो इमेल जाँच गर्नुहोस्

# passwordResetDescriptionDescription
source: Detailed description of what to do after a password reset email is sent.
ne: पासवर्ड रिसेट इमेल पठाइएपछि के गर्ने भन्ने विस्तृत विवरण।

# homeNavigationBar
source: Home
ne: गृहपृष्ठ

# libraryNavigationBar
source: Library
ne: पुस्तकालय

# groupNavigationBar
source: Groups
ne: समूहहरू

# postHeaderMessage
source: What's on your mind?
ne: तपाईंको मनमा के छ?

source: Add Post
ne: पोस्ट थप्नुहोस्

source: Cancel
ne: रद्द गर्नुहोस्

source: Post
ne: पोस्ट

source: Title
ne: शीर्षक

# titlePlaceholder
source: Write a Title for post here
ne: पोस्टको लागि शीर्षक यहाँ लेख्नुहोस्

source: Content
ne: सामग्री

# contentPlaceholder
source: Write the content of the post here
ne: पोस्टको सामग्री यहाँ लेख्नुहोस्

source: Thumbnail
ne: लघुचित्र

source: Select Thumbnail
ne: लघुचित्र चयन गर्नुहोस्

source: Change Thumbnail
ne: लघुचित्र परिवर्तन गर्नुहोस्

# recommendedSize
source: Recommended size: 1200x1200px
ne: सिफारिस गरिएको आकार: १२००x१२०० पिक्सेल

# validTitle
source: Title cannot be empty
ne: शीर्षक खाली हुन सक्दैन

# validContent
source: Content cannot be empty
ne: सामग्री खाली हुन सक्दैन

# postSuccess
source: Post has been posted successfully
ne: पोस्ट सफलतापूर्वक पठाइयो

source: Loading...
ne: लोड हुँदैछ...

# forgotPasswordHeader
source: Don't worry we got covered
ne: चिन्ता नगर्नुहोस्, हामीसँग समाधान छ।

# encouringMessageForForgotPassword
source: Just enter email and you will receive a mail to reset your password
ne: इमेल प्रविष्ट मात्र गर्नुहोस्, र तपाईंले पासवर्ड रिसेट गर्न मेल प्राप्त गर्नुहुनेछ।

# libraryHallTitle
source: TU Online Library
ne: टु अनलाइन पुस्तकालय

# libraryHallDescription
source: Access digital books and personal library
ne: डिजिटल पुस्तकहरूमा पहुँच र व्यक्तिगत पुस्तकालय।

# onlineBookStoreTitle
source: Online Book Store
ne: अनलाइन पुस्तक स्टोर

# onlineBookStoreDescription
source: Browse and download digital books from our extensive collection.
ne: हाम्रो विशाल सङ्ग्रहबाट डिजिटल पुस्तकहरू ब्राउज गर्नुहोस् र डाउनलोड गर्नुहोस्।

# personalLibraryTitle
source: {userName}'s Personal Library
ne: {userName} को व्यक्तिगत पुस्तकालय

# personalLibraryDescription
source: Read your downloaded books from here
ne: यहाँबाट तपाईंको डाउनलोड गरिएका पुस्तकहरू पढ्नुहोस्।

# onlineBookStoreQuote
source: In the digital realm, every book is a gateway to infinite worlds waiting to be explored.
ne: डिजिटल संसारमा, प्रत्येक पुस्तक अनन्त संसारहरूको ढोका हो, जसले अन्वेषणको लागि पर्खिरहेको छ।

# offlineBookStoreQuote
source: Within these pages, stories breathe, characters whisper, and imagination knows no bounds.
ne: यी पानाहरूभित्र, कथाहरू सुस्केरा लिन्छन्, पात्रहरू कानमा फुसफुसाउँछन्, र कल्पनाले कुनै सीमा जान्दैन।

# profileDrawer
source: Profile
ne: प्रोफाइल

# settingDrawer
source: Settings
ne: सेटिङहरू

# logoutDrawer
source: Logout
ne: लगआउट

# aboutDrawer
source: About
ne: बारेमा

# feedbackDrawer
source: Feedback
ne: प्रतिक्रिया

# teacherDrawer
source: Teacher
ne: शिक्षक

# studentUnionDrawer
source: Students Union
ne: विद्यार्थी संघ

# settingsAppBarTitle
source: Settings
ne: सेटिङहरू

# applicationSettingsCardTitle
source: Application Settings
ne: एप्लिकेसन सेटिङहरू

# darkModeTitle
source: Dark Mode
ne: डार्क मोड

# darkModeSubtitle
source: Toggle between light and dark themes
ne: उज्यालो र अँध्यारो थीम बीच सङ्क्रमण गर्नुहोस्

# languagePreferencesCardTitle
source: Language Preferences
ne: भाषा प्राथमिकताहरू

# accountCardTitle
source: Account
ne: खाता

# logoutTitle
source: Logout
ne: लग आउट

# logoutSubtitle
source: Sign out of your account
ne: आफ्नो खाताबाट बाहिर निस्कनुहोस्

# privacyTitle
source: Privacy
ne: गोपनीयता

# privacySubtitle
source: Manage your privacy settings
ne: आफ्नो गोपनीयता सेटिङहरू व्यवस्थापन गर्नुहोस्

# logoutDialogTitle
source: Logout
ne: लग आउट

# logoutDialogDescription
source: Are you sure you want to log out?
ne: के तपाईं साँच्चै लग आउट गर्न चाहनुहुन्छ?

# cancelButton
source: Cancel
ne: रद्द गर्नुहोस्

# logoutButton
source: Logout
ne: लग आउट

# aboutAppBarTitle
source: About Lernza
ne: लर्न्जाको बारेमा

# aboutCardTitle
source: About Lernza
ne: लर्न्जा बारे

# aboutCardDescription
source: Lernza is a comprehensive educational platform designed to empower students and teachers. Our mission is to provide a one-stop solution for all educational needs, offering a diverse range of resources including books, videos, notes, and interactive learning tools.
ne: लर्न्जा एक व्यापक शैक्षिक मञ्च हो जो विद्यार्थी र शिक्षकहरूलाई सशक्त बनाउन डिजाइन गरिएको छ। हाम्रो लक्ष्य सबै शैक्षिक आवश्यकताहरूका लागि एक स्टप समाधान प्रदान गर्नु हो, जसमा पुस्तकहरू, भिडियोहरू, नोट्स र इन्टरएक्टिभ सिकाइ उपकरणहरूको विविध श्रृंखला समावेश छ।

# appDetailsCardTitle
source: App Details
ne: एप विवरण

# versionLabel
source: Version
ne: संस्करण

# websiteLabel
source: Website
ne: वेबसाइट

# websiteLaunchErrorTitle
source: Error Could not launch
ne: त्रुटि: वेबसाइट खोल्न सकिएन

# websiteLaunchErrorDescription
source: Unable to open the website
ne: वेबसाइट खोल्न असफल भयो

# profileScreenTitle
source: Student Profile
ne: विद्यार्थी प्रोफाइल

# profileEditScreenTitle
source: Edit Student Screen
ne: विद्यार्थी स्क्रीन सम्पादन गर्नुहोस्

# personalDetailsCardTitle
source: Personal Details
ne: व्यक्तिगत विवरण

# familyDetailsCardTitle
source: Family Details
ne: परिवार विवरण

# courseDetailsCardTitle
source: Course Details
ne: पाठ्यक्रम विवरण

# fullNameLabel
source: Full Name
ne: पूरा नाम

# phoneLabel
source: Phone
ne: फोन

# addressLabel
source: Address
ne: ठेगाना

# fatherNameLabel
source: Father's Name
ne: बुवाको नाम

# motherNameLabel
source: Mother's Name
ne: आमाको नाम

# courseNameLabel
source: Course Name
ne: पाठ्यक्रमको नाम

# batchLabel
source: Batch
ne: समूह

# saveChangesButtonText
source: Save Changes
ne: परिवर्तनहरू सुरक्षित गर्नुहोस्

# placeholderNotAvailable
source: N/A
ne: उपलब्ध छैन

# groupsCardTitile
source: Groups
ne: समूहहरू

# aboutShadanandaTitle
source: About Shadananda
ne: षडान्दको बारेमा

# aboutShadanandaIntroductionTitle
source: Introduction
ne: परिचय

# aboutShadanandaIntroductionContent
source: Shadananda Multiple Campus was established in 2067 BS in Dingla, Bhojpur, affiliated with Tribhuvan University. It is named after education reformer Balaguru Shadananda, who established Nepal's first community-run school. From this inspiration, we created an online library to support students and the community.
ne: षडान्द बहुचर्चित क्याम्पस २०६७ सालमा दिङ्ला, भोजपुरमा स्थापित भएको हो, त्रिभुवन विश्वविद्यालयसँग सम्बद्ध। यसको नाम शैक्षिक सुधारक बालागुरु षडान्दको नाममा राखिएको हो, जसले नेपालको पहिलो सामुदायिक विद्यालयको स्थापना गरेका थिए। यस प्रेरणाबाट हामीले विद्यार्थी र समुदायको सहयोगका लागि अनलाइन पुस्तकालय सुरु गरेका हौँ।

# aboutShadanandaObjectiveTitle
source: Objective
ne: उद्देश्य

# aboutShadanandaObjectiveContent
source: The main objective is to provide quality higher education to residents of remote and northern areas of Bhojpur district, with special focus on women, Dalits, indigenous people, and marginalized groups.
ne: मुख्य उद्देश्य भोजपुर जिल्लाका दुर्गम र उत्तरका क्षेत्रका बासिन्दाहरूलाई गुणस्तरीय उच्च शिक्षा प्रदान गर्नु हो, विशेष ध्यान महिला, दलित, आदिवासी र हाशिएमा रहेका समूहहरूमा।

# aboutShadanandaFacultiesTitle
source: Academic Faculties
ne: शैक्षिक संकायहरू

# aboutShadanandaEducationFaculty
source: Education
ne: शिक्षा

# aboutShadanandaEducationSubject1
source: English
ne: अंग्रेजी

# aboutShadanandaEducationSubject2
source: Nepali
ne: नेपाली

# aboutShadanandaEducationSubject3
source: Economics
ne: अर्थशास्त्र

# aboutShadanandaEducationSubject4
source: Health
ne: स्वास्थ्य

# aboutShadanandaEducationSubject5
source: Population Studies
ne: जनसांख्यिकी अध्ययन

# aboutShadanandaManagementFaculty
source: Management
ne: प्रबंधन

# aboutShadanandaManagementCourses
source: Bachelor Level Courses
ne: ब्याचलर स्तरका पाठ्यक्रम

# aboutShadanandaServicesTitle
source: Our Services
ne: हाम्रा सेवाहरू

# aboutShadanandaService1
source: Quality Education with focus on student academic excellence
ne: विद्यार्थी शैक्षिक उत्कृष्टतामा ध्यान दिइ गुणस्तरीय शिक्षा

# aboutShadanandaService2
source: Annual and Internal Examination System
ne: वार्षिक र आन्तरिक परीक्षा प्रणाली

# aboutShadanandaService3
source: Well-equipped Computer Lab with basic computer education
ne: सुसज्जित कम्प्युटर प्रयोगशाला र आधारभूत कम्प्युटर शिक्षा

# aboutShadanandaService4
source: Library and E-Library Services
ne: पुस्तकालय र ई-पुस्तकालय सेवाहरू

# aboutShadanandaService5
source: Free higher education for eligible first-year students
ne: योग्य प्रथम वर्षका विद्यार्थीलाई निःशुल्क उच्च शिक्षा

# studentUnionTitle
source: Student Union
ne: विद्यार्थी संघ

# studentUnionCouncilTitle
source: Student Union Election 2079
ne: विद्यार्थी परिषद् २०८१

# studentUnionPresidentName
source: Girija Karki
ne: गिरीजा कार्की

# studentUnionPresidentPosition
source: Student Union President
ne: विद्यार्थी संघका अध्यक्ष

# studentUnionPresidentDescription
source: Girija Karki, a visionary student of ANPA-5, leads as the president of the student union for 2081. He inspires change through dedication and active participation in college initiatives.
ne: गिरीजा कार्की, एएनपीए-५ का एक दृष्टिवादी विद्यार्थी, २०८१ को विद्यार्थी संघका अध्यक्षका रूपमा नेतृत्व गर्दै छन्। उहाँ शैक्षिक पहलकदमी र कलेजका आयोजनामा सक्रिय भागीदारीद्वारा परिवर्तनको प्रेरणा दिनुहुन्छ।

# studentUnionTableHeaderSn
source: S.N
ne: क्र.सं.

# studentUnionTableHeaderName
source: Name
ne: नाम

# studentUnionTableHeaderPosition
source: Position
ne: पद

# studentUnionTableHeaderRollNo
source: Roll No.
ne: रोल नम्बर

# teacherScreenTitle
source: Campus Faculty
ne: क्याम्पस शिक्षक

# teacherChiefName
source: Nagendra Basnet
ne: नगेन्द्र बस्नेत

# teacherChiefPosition
source: Campus Chief
ne: क्याम्पस प्रमुख

# teacherChiefDescription
source: Mr. Nagendra Basnet serves as the Campus Chief, leading our institution with dedication and vision towards academic excellence.
ne: नगेन्द्र बस्नेत सर क्याम्पस प्रमुखका रूपमा सेवा प्रदान गर्दै, शैक्षिक उत्कृष्टताका लागि समर्पण र दृष्टिकोणका साथ संस्थानको नेतृत्व गर्दै हुनुहुन्छ।
