[
    {
        "id": "78e069a8-78eb-4917-8753-f9f440a5c185",
        "isbn": "",
        "bookTitle": "Notes of Literature For Language Development",
        "description": "This is the notes of the course Literature for Language Development. The course provides an overview of how literature can be used as a powerful tool to enhance language learning and development. It explores the integration of literary works such as stories, poems, and plays into language teaching to improve vocabulary, grammar, critical thinking, and cultural awareness. The course also examines strategies for selecting age-appropriate and contextually relevant literature, fostering engagement through creative activities, and developing communication skills through discussion and analysis of literary texts. By connecting literature with language education, the course equips educators and learners with innovative methods to cultivate linguistic competence and a deeper appreciation for literature.",
        "code": "446",
        "bookUrl": "courseBooks/78e069a8-78eb-4917-8753-f9f440a5c185.pdf",
        "language": "en",
        "author": ["Anonymous"],
        "categories": [
            "Language Development",
            "Literature in Education",
            "Teaching Methodologies",
            "Curriculum Design",
            "Educational Resource",
            "Language Teaching Strategies",
            "B.Ed Academic Reference",
            "Notes"
        ],
        "publisher": "Anonymous",
        "isActive": true,
        "thumbnail": "courseBooks/78e069a8-78eb-4917-8753-f9f440a5c185.png",
        "createdAt": "",
        "updatedAt": "",
        "founded": true,
        "moreImageUrl": [],
        "courseId": "f85c24ab-dac6-4f5e-b61e-b3910163ebbd",
        "year": 4
    }, 
    {
        "id": "6f554180-feb0-4df2-b114-6d833bf93794",
        "isbn": "",
        "bookTitle": "Notes of Fundamentals of Investment",
        "description": "This is the notes of the course Fundamentals of Investment. The course provides an in-depth overview of the principles and practices of investment. It explores key concepts such as risk and return, portfolio management, asset allocation, and the various types of investment instruments including stocks, bonds, mutual funds, and real estate. The course also examines the role of financial markets, investment analysis techniques, and strategies for making informed investment decisions. By connecting theoretical knowledge with practical applications, the course equips learners with the skills to evaluate investment opportunities, understand market trends, and achieve financial objectives effectively.",
        "code": "FIN 253",
        "bookUrl": "courseBooks/6f554180-feb0-4df2-b114-6d833bf93794.pdf",
        "language": "en",
        "author": ["Anonymous"],
        "categories": [
            "Finance Studies",
            "Investment Strategies",
            "Portfolio Management",
            "Economic Resources",
            "Financial Literacy",
            "B.Com Academic Reference",
            "Market Analysis"
        ],
        "publisher": "Anonymous",
        "isActive": true,
        "thumbnail": "courseBooks/6f554180-feb0-4df2-b114-6d833bf93794.png",
        "createdAt": "",
        "updatedAt": "",
        "founded": true,
        "moreImageUrl": [],
        "courseId": "b112a345-0c7d-404d-8e0a-238a75b04c8c",
        "year": 4
    }, 
    {
        "id": "fcea1d73-2b34-4e5b-a3b6-efa74bda33fd",
        "isbn": "",
        "bookTitle": "Notes of Women Entrepreneurship",
        "description": "This is the notes of the course Women Entrepreneurship. The course provides an insightful exploration of the role of women in entrepreneurship, highlighting the challenges and opportunities they face in starting and managing businesses. It delves into key topics such as entrepreneurial mindset, business planning, financial management, marketing strategies, and innovation. The course also examines the impact of societal and cultural factors, support systems, and policies designed to empower women entrepreneurs. By combining theoretical concepts with real-world case studies, the course equips learners with the knowledge and skills to foster entrepreneurship and promote gender inclusivity in the business world.",
        "code": "MGT220",
        "bookUrl": "courseBooks/fcea1d73-2b34-4e5b-a3b6-efa74bda33fd.pdf",
        "language": "en",
        "author": ["Anonymous"],
        "categories": [
        "Entrepreneurship Studies",
        "Women Empowerment",
        "Business Strategies",
        "Leadership and Management",
        "Economic Development",
        "Gender Studies",
        "BBA Academic Reference"
        ],
        "publisher": "Anonymous",
        "isActive": true,
        "thumbnail": "courseBooks/fcea1d73-2b34-4e5b-a3b6-efa74bda33fd.png",
        "createdAt": "",
        "updatedAt": "",
        "founded": true,
        "moreImageUrl": [],
        "courseId": "b112a345-0c7d-404d-8e0a-238a75b04c8c",
        "year": 4
    },
    {
        "id": "16e5619c-03d0-4b77-a265-b92fa7915f5b",
        "isbn": "",
        "bookTitle": "Notes for Corporative Finance",
        "description": "This is the notes of the course Corporate Finance. The course provides a comprehensive overview of the principles and practices of corporate finance, focusing on how organizations manage their financial resources to achieve strategic objectives. Key topics include financial analysis, capital budgeting, cost of capital, corporate valuation, risk management, and financing decisions. The course also examines the role of financial markets, mergers and acquisitions, and dividend policies. By blending theoretical frameworks with practical applications, the course equips learners with the tools and insights necessary to make informed financial decisions and maximize corporate value.",
        "code": "FIN 204",
        "bookUrl": "courseBooks/16e5619c-03d0-4b77-a265-b92fa7915f5b.pdf",
        "language": "en",
        "author": ["Anonymous"],
        "categories": [
        "Finance Studies",
        "Corporate Strategy",
        "Financial Analysis",
        "Investment Planning",
        "Risk Management",
        "Business Administration",
        "MBA Academic Reference"
        ],
        "publisher": "Anonymous",
        "isActive": true,
        "thumbnail": "courseBooks/16e5619c-03d0-4b77-a265-b92fa7915f5b.png",
        "createdAt": "",
        "updatedAt": "",
        "founded": true,
        "moreImageUrl": [],
        "courseId": "b112a345-0c7d-404d-8e0a-238a75b04c8c",
        "year": 4
    }
]